# 네트워크 기반 통신 및 계층 구조

## 학습목표

- [ ] 네트워크의 기본 통신 구조를 알 수 있다.
- [ ] 네트워크의 계층 구조를 알 수 있다.

---

## 네트워크의 개요

- 노드(네트워크에 속한 컴퓨터, 통신 장비)들이 데이터를 공유할 수 있게 하는 디지털 전기통신망의 하나
- 장비들을 서로 대화가 가능하도록 묶어 주는 것

## 네크워크의 종류

### 인터넷

- 인터넷 : 여러 개의 네트워크를 묶었다는 의미
- 하나의 프로토콜(TCP/IP)만을 사용
  - 프로토콜 : 통신 규약

### 인트라넷

- 내부의 네트워크
- 하나의 프로토콜(TCP/IP)를 사용
- 회사 사람 외에 다른 사람은 인터넷으로 접속 불가
  - 사내에서만 허용되는 네트워크

### 엑스트라넷

- 인트라넷과 유사, 기업 외에 협력 회사나 고객에게도 사용할 수 있도록 구축한 통신망

### LAN

- Local Area Network : 어느 한정된 공간에서 네트워크를 구성

## 네트워크와 케이블

### LAN

- 위와 동일

### WAN

- Wide Area Network : 멀리 떨어진 지역을 서로 연결하는 네트워크, 인터넷이 대표적, LAN과 LAN을 다시 하나로 묶은 네트워크

## 네트워크 방식

### 이더넷

- LAN에는 여러 가지 네트워크 방식 존재, 현재 대중적인 방식은 bus형의 이더넷 방식
  - 네트워크 방식의 90% 이상 차지
- 인터넷은 TCP/IP, 이더넷은 CSMA/CD 프로토콜 방식으로 데이터를 전송

### CSMA/CD 프로토콜 방식

- 이더넷은 (CSMA/CD - 반송파 감지 다중 접속 및 충돌 탐지 기술)을 사용
- CSMA/CD - Carrier Sense Multiple Access/Collision Detection 의 축약어

  - Carrier Sense : 목적지로 프레임을 전송하기 전에 현재 전송 중인 프레임 유무 확인

    ![Carrier_Sense](https://user-images.githubusercontent.com/60249222/117545421-a9613080-b060-11eb-9f42-6a5e39aa2442.png)

  - Multiple Access : 케이블 상에서 송수신 중인 프레임이 있다면 기다리고 없으면 목적지로 프레임 전송

    ![Collision_Detection](https://user-images.githubusercontent.com/60249222/117545439-bed65a80-b060-11eb-8acd-7889ff6873f0.png)

  - Collision Detection: Ethernet은 복수의 장비가 동시에 프레임 전송이 가능하며, 이 경우 충돌이 있을 수 있으므로 프레임 전후 충돌발생을 확인

    ![Multiple_Access](https://user-images.githubusercontent.com/60249222/117545453-ceee3a00-b060-11eb-836c-a337f5c63425.png)

  → CSMA/CD 방식은 통신중이지 않은 상태에서 데이터를 실어 보낸 다음, 전송 상태를 확인하는 방식

  → 두 대의 컴퓨터가 동시에 보내면 충돌 발생, 랜덤하게 시간을 기다렸다 재발송

- 동작 절차
  1. 네트워크를 사용하려는 컴퓨터는 먼저 현재 네트워크 위에 흐르고 있는 데이터가 있는지를 감지한다.
  2. 만약 현재 다른 데이터가 전송 중이면 사용할 수 있을 때까지 기다리고 아니면 전송을 시작한다.
  3. 여러 군데에서 동시에 전송을 시작해 충돌이 발생하면 최소 패킷 시간 동안 전송을 계속해, 다른 컴퓨터가 충돌을 탐지할 수 있도록 한다.
  4. 그 뒤, 임의 시간 동안 기다린 뒤에 다시 신호(반송파)를 감지하고, 네트워크 사용자가 없으면 전송을 다시 시작한다.
  5. 전송을 마치면, 상위 계층에 전송이 끝났음을 알리고 끝마친다.
  6. 여러 번 다시 시도했음에도 전송에 실패하면 이를 상위 계층에 알리고 끝마친다.

### 토큰링

- 네트워크에서 토큰을 가진 PC만 데이터를 실어 보낼 수 있는 방식
- 데이터를 전부 전송하면 옆 PC에 토큰을 건네줌

  → 충돌이 발생하지 않는 장점이 있음

  → 다른 PC들이 보낼 데이터가 없더라도 PC를 거쳐서 토큰이 올 때까지 대기

  → 속도가 느려 약간의 충돌을 감수하더라도 이더넷 방식을 사용

  ![네트워크 기반 통신 및 계층 구조 a07717b43a854875bb88984731a66fb3](https://user-images.githubusercontent.com/60249222/117545468-db729280-b060-11eb-8eba-147541882e48.png)

## 네트워크 Address

### MAC 주소

- MAC → Media Access Control의 준말
  - 네트워크 상에서 통신을 위해 서로 구분하는 주소 → MAC 주소
- TCP/IP 통신을 위해서는 ARP를 통해 IP주소를 MAC 주소로 바꾸는 절차가 필요

### IP 주소

- 네트워크에서 장치들이 서로 인식하고 통신하기 위해 사용하는 특수 번호
- 대쵸적인 IP 주소 체계는 IPv4 와 IPv6가 존재

## 통신 방식

### 유니캐스트

- 단일 PC의 MAC 주소가 프레임 안에 항상 있어야 하는 통신, 출발지와 목적지의 MAC 주소가 프레임 안에 항상 있어야 한다.
- 즉, 특정 대상이랑 1:1 통신

### 브로드캐스트

- 로컬 LAN 상에 붙어있는 모든 네트워크 장비들에게 보내는 통신
  - 로컬 LAN은 라우터에 의해서 구분지어진 공간 : broadcast 도메인
- 내가 살고 있는 네트워크 안의 모든 네트워크 장비들에게 통신할 때 쓰기 위한 방식
- ARP가 broadcase 방식
  - IP주소를 가지고 MAC 주소를 알기 위해서 ARP를 사용한다.

### 멀티캐스트

- 그룹 멤버들에게만 보낼 때 ex) 100명 중 20명에게만 보내고자 할 경우

## OSI 7 Layer

- OSI의 단계를 7 Layer로 표준화하여 효율성을 높이기 위해 사용
- 데이터의 흐름이 한 눈에 보인다
- Trouble shooting이 쉽다.
- 네트워크를 공부하는 사람들이 네트워크 동작 과정을 쉽게 습득할 수 있다.
- 여러 회사 장비를 사용해도 네트워크가 이상 없이 돌아간다.

![osi7layer](https://user-images.githubusercontent.com/60249222/117545611-7ff4d480-b061-11eb-972e-70ba70197167.PNG)
